       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID.    SUBPGM.                                           
       ENVIRONMENT DIVISION.                                            
       INPUT-OUTPUT SECTION.                                            
       FILE-CONTROL.                                                    
             SELECT INFIL2 ASSIGN TO DD2.                               
             SELECT SORT-FILE ASSIGN TO SORTWK01.                       
       DATA DIVISION.                                                   
       FILE SECTION.                                                    
       FD INFIL2.                                                       
       01 INREC     PIC X(80).                                          
       SD SORT-FILE.                                                    
       01 SORTREC.                                                      
          05 PET-ID  PIC XXX.                                           
          05 MRP     PIC 9(4)V99.                                       
          05 QUANTOB PIC 99.                                            
          05         PIC X(69).                                         
       PROCEDURE DIVISION.                                              
       MAIN-PARA.                                                       
              DISPLAY " SORT "                                          
              SORT SORT-FILE                                            
              ASCENDING KEY PET-ID                                      
              USING INFIL2 GIVING INFIL2.                               
              IF SORT-RETURN IS NOT = 0                                 
                 DISPLAY " SORT RETURN " SORT-RETURN                    
              ELSE                                                      
                 DISPLAY " SORT SUCCESSFUL "                            
              END-IF                                                    
              EXIT PROGRAM.                                             